package com.nikolaev.horeca.datasets;

import com.nikolaev.horeca.domains.UserRating;

import java.util.ArrayList;
import java.util.Date;
import java.util.List;

public class UserRatingDataset {
    public List<UserRating> userRatingList = new ArrayList<>();
    public int size = 0;
    public UserRatingDataset(){
        addData(5, 5, 5, 5, 5, 5, 5, "Очень крутое место. Отличный располагающий к себе персонал. Рекомендую!");
        addData(5, 5, 5, 5, 5, 3, 5, "Всё прекрастно, но дороговато");
        addData(5, 5, 5, 5, 5, 5, 5, "Великолепная компания из персонала и посетителей, если найти свою компанию, просто пушка! рекомендую!");
        addData(2, 2, 1, 1, 1, 1, 2, "дорого, не комфортно внутри. дизлайкают походу хозяева) за такую цену другие ожидания.");
        addData(1, 1, 1, 2, 2, 2, 2, "Все удовольствие от посещения испортил сервис");
        addData(4, 5, 4, 5, 4, 4, 5, "Советую всем, все вкусно, весело, и да QR код попросили, посмотрели, персонал отзывчивый");
        addData(2, 2, 2, 2, 2, 2, 2, "ХАМСКОЕ и НЕУВАЖИТЕЛЬНОЕ отношение к клиентам");
        addData(4, 4, 4, 4, 4, 4, 4, "приятное место и цены");
        addData(1, 1, 1, 1, 1, 2, 2, "На протяжении 30 минут пока там находился, на полу валялся мусор и никто из персонала не обращал на это внимания. Так же второй этаж закрыт, хотя по расписанию уже должен был быть открыт. На что администратор ответил когда захочу, тогда и открою");
        addData(3, 4, 3, 4, 3, 3, 3, "Не могу сказать, что очень здорово, но и не совсем уж плохо.");
        addData(5, 4, 4, 5, 4, 5, 5, "Уютное замечательное место) по вечерам иногда разжигают камин можно посидеть у камина по дымить ) но и так же можно себя развлечь или приставкой ps4 или настольными играми)");
        addData(1, 1, 1, 1, 1, 1, 2, "персонал игнорирует гостей");
        addData(1, 2, 2, 1, 1, 2, 2, "Прошлый поход был так себе, последний тоже...");
        addData(5, 5, 5, 5, 5, 5, 5, "Отличное место, для приятного и весёлого времяпровождения. Всегда море позитива");
        addData(5, 5, 5, 5, 5, 5, 5, "персонал очень весёлый и всегда готов помочь скрасить вечер а так же мастера своего дела) всем советую посетить место чудесное");
        addData(5, 5, 5, 5, 5, 5, 5, "Чётко. Лаконично. И прекрасные виды на центр города.");
        addData(1, 3, 2, 2, 2, 2, 2, "Скольский пол незамечают, заняты проверкой QR кодов.");
        addData(5, 5, 5, 5, 5, 5, 5, "уютное место , приятная не громкая музыка , дружеская атмосфера");
        addData(5, 3, 1, 5, 5, 2, 2, "Прямо в центре города - такое ужасное ШОКирующее место!");
        addData(5, 5, 3, 3, 5, 4, 4, "отзывчивый персонал");
        addData(5, 5, 5, 5, 5, 5, 5, "Милое местечко с приятным интерьером и вежливым персоналом.");
        addData(1, 1, 1, 1, 1, 1, 1, "Отвратительно. Персонал наплевательски относится к гостям.");
        addData(5, 5, 5, 5, 5, 5, 5, "приятная атмосфера и крутой персонал");
        addData(5, 5, 5, 5, 5, 5, 5, "Доброжелательный и вежливый персонал! Всё очень понравилось!");
        addData(5, 5, 5, 5, 5, 5, 5, "Заведение расположено в центре города, круглосуточное, казалось бы, обслуживание должно быть поставлено на поток, но нет.");
        addData(5, 5, 4, 5, 5, 3, 3, "приятная атмосфера и отзывчивый персонал");
        addData(5, 5, 5, 5, 5, 5, 5, "Доброжелательный и вежливый персонал! Всё очень понравилось!");
        addData(1, 4, 4, 5, 5, 3, 3, "Заведение расположено в центре города, круглосуточное, казалось бы, обслуживание должно быть поставлено на поток, но нет.");
        addData(5, 4, 4, 5, 5, 5, 5, "Замечательное заведение. Было довольно приятно провести время у вас");
        addData(5, 5, 5, 5, 5, 5, 5, "всей семьей рекомендуем данное заведение");
        addData(5, 5, 5, 5, 5, 5, 5, "Уютная атмосфера. Прекрасный персонал.Цены соответствующие");
        addData(5, 5, 5, 5, 5, 4, 4, "отличное место для отдыха");
        addData(3, 3, 5, 3, 2, 2, 2, "Я не знаю, что с вами стало, но в последнее время одно разочарование");
        addData(5, 5, 5, 5, 5, 5, 5, "Недорого, чисто и обслуживание на высоте.");
        addData(5, 5, 5, 5, 2, 5, 5, "Очень хорошее и приветливое обслуживание, в то же время неприятная публика");
        addData(5, 5, 5, 5, 5, 5, 5, "Хорошее расположение и часы работы.");
        addData(5, 5, 4, 5, 5, 4, 4, "персонал очень приятный. Обслуживали хорошо");
        addData(1, 1, 2, 2, 1, 2, 2, "ужасный персонал, одни хамы");
        addData(5, 5, 5, 5, 5, 5, 5, "мило, уютно, стильно");
        addData(4, 4, 5, 4, 5, 2, 2, "цена не оправдывает качество");
        addData(5, 5, 4, 5, 5, 5, 5, "приятно, тихо и комфортно!");
        addData(5, 5, 4, 5, 5, 5, 5, "Приятная атмосфера, быстрое, качественное обслуживание.");
        addData(1, 2, 1, 1, 2, 2, 1, "Если есть возможность, лучше выбрать другое место.");
        addData(5, 5, 5, 5, 5, 4, 4, "Хорошее заведение, стильное, с приветливым персоналом.");
        addData(5, 5, 4, 4, 4, 1, 4, "Цены совсем не бюджетные.");
    }

    private void addData(int personnelRate, //max 5
                         int tasteRate,//max 5
                         int locationRate,//max 5
                         int cleanRate,//max 5
                         int moodRate,//max 5
                         int serviceToPriceRate,//max 5
                         int foodToPriceRate,//max 5
                         String comment){
        UserRating rating = new UserRating();
        rating.setPersonnelRate(personnelRate);
        rating.setTasteRate(tasteRate);
        rating.setDate(new Date());
        rating.setLocationRate(locationRate);
        rating.setCleanRate(cleanRate);
        rating.setMoodRate(moodRate);
        rating.setServiceToPriceRate(serviceToPriceRate);
        rating.setFoodToPriceRate(foodToPriceRate);
        rating.setComment(comment);
        userRatingList.add(rating);
        this.size++;
    }
}
